app/views/services/edit.html.erb

      <%=f.label :description%> <%=f.text_field :description%>
      <%=f.label :subject%> <%=f.collection_select :subject_id, Subject.all, :id, :name%>
---
SELECT "subjects".* FROM "subjects"