app/views/services/new.html.erb

SELECT "subjects".* FROM "subjects"
---
  <%=f.label :description%> <%=f.text_field :description%>
  <%=f.label :subject%> <%=f.collection_select :subject_id, Subject.all, :id, :name%>