app/views/services/show.html.erb

SELECT "services"."id" FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ?  [["student_id", 1]]
---
  <%= link_to "DELETE", service_path(@service.id), method: "DELETE" %>
<%elsif !@self_user.student_service_ids.include?(@service.id)%>