app/views/users/show.html.erb

SELECT COUNT(*) FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ?  [["student_id", 1]]
SELECT "services".* FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ?  [["student_id", 2]]
---
          <h3>Age: <%=student.age %></h3>
          <%if student.services_of_student(@user).count == 1 %>
            <h3>Service:
              <%=link_to student.services_of_student(@user).first.name,
                      service_path(student.services_of_student(@user).first.id) %>

SELECT COUNT(*) FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ?  [["student_id", 1]]
SELECT "services".* FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ?  [["student_id", 2]]
---
          <%else %>
            <h3>Services: <%= student.services_of_student(@user).size %></h3>
            <div class="hover-content">
              <%student.services_of_student(@user).each do |service| %>

SELECT "services".* FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ? AND "services"."teacher_id" = ?  [["student_id", 2], ["teacher_id", 3]]
SELECT COUNT(*) FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ? AND "services"."teacher_id" = ?  [["student_id", 1], ["teacher_id", 2]]
SELECT  "services".* FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ? AND "services"."teacher_id" = ? ORDER BY "services"."id" ASC LIMIT ?  [["student_id", 2], ["teacher_id", 3], ["LIMIT", 1]]
---
            <h3>Age:<%=teacher.age %></h3>
            <%if @user.services_of_student(teacher).size == 1%>
              <h3>Service:
                <%=link_to @user.services_of_student(teacher).first.name,
                           service_path(@user.services_of_student(teacher).first.id)%>

SELECT COUNT(*) FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ? AND "services"."teacher_id" = ?  [["student_id", 2], ["teacher_id", 3]]
SELECT "services".* FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ? AND "services"."teacher_id" = ?  [["student_id", 2], ["teacher_id", 3]]
---
            <%else %>
              <h3>Services: <%=@user.services_of_student(teacher).size %></h3>
              <div class="hover-content">
                <%@user.services_of_student(teacher).each do |service| %>