app/views/subjects/index.html.erb

SELECT "services".* FROM "services" WHERE "services"."subject_id" = ?  [["subject_id", 1]]
---
  <div class="hover-content">
    <%subject.services.each do |service|%>