app/views/subjects/new.html.erb

SELECT "categories".* FROM "categories"
---
  <%=f.label :description%> <%=f.text_field :description%>
  <%=f.label :category%> <%=f.collection_select :category_id, Category.all, :id, :name%>