app/views/subjects/show.html.erb

<div class="hover-content">
  <%@subject.services.each do |service|%>
---
SELECT "services".* FROM "services" WHERE "services"."subject_id" = ?  [["subject_id", 1]]