app/controllers/application_controller.rb

  def init_user
    if current_user
      @self_user = User.find_by_id(current_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]