app/controllers/categories_controller.rb

  def index
    if params[:sort] == "my"
      @categories  = @self_user.teacher_categories
    elsif params[:sort] == "i_use"
      @categories = @self_user.student_categories
    else
      @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.create(
        name: params[:category][:name],
        description: params[:category][:description]
    )
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "launguages"], ["description", ""], ["created_at", "2019-02-08 15:09:41.294962"], ["updated_at", "2019-02-08 15:09:41.294962"]]

  def destroy
    Category.find(params[:id]).delete
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]