app/controllers/orders_controller.rb

  def index
    if params[:sort] == "i_use"
      @orders = User.find_by_id(@self_user).teacher_orders

    elsif params[:sort] == "my"
      @orders = User.find_by_id(@self_user).orders
    elsif admin?
      @orders = Order.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" INNER JOIN "services" ON "orders"."service_id" = "services"."id" WHERE "services"."teacher_id" = ?  [["teacher_id", 2]]

  def create

    @order = Order.create(
        service_id: params[:order][:service_id],
        comment: params[:order][:comment],
        student_id: current_user,
        )
---
INSERT INTO "orders" ("service_id", "comment", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["service_id", 4], ["comment", "I want to join"], ["student_id", 1], ["created_at", "2019-02-08 11:16:03.836799"], ["updated_at", "2019-02-08 11:16:03.836799"]]

  def destroy
    Order.find(params[:id]).delete
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]