app/controllers/services_controller.rb

  def index
    @sort_direction = params[:sort_order] || "asc"
    @sort_field = params[:sort] || "id"
    @sort_type = params[:type] || "all"
    if @sort_field == "date"
      @sort_field = "created_at"
    end
    if @sort_field == "rating"
      @sort_field = "created_at"
    end

    get_subjects
    puts @subjects
    @current_subjects = @subjects
    @current_subjects ||= Subject.all


    if @sort_type == "my"
      @services = @self_user.services
    elsif @sort_type == "i_use"
      @services = @self_user.student_services
    elsif @sort_type == "other"
      @services = Service.all.where("teacher_id != #{@self_user.id}")
    elsif @sort_type == "all"
      @services = Service.all
    else
      @services = Service.all.where(teacher_id: @sort_type)
    end
    @services = @services.where(subject: @current_subjects);
---
SELECT "services".* FROM "services" WHERE "services"."teacher_id" = ?  [["teacher_id", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]