app/controllers/services_controller.rb

SELECT "services".* FROM "services" INNER JOIN "orders" ON "services"."id" = "orders"."service_id" WHERE "orders"."student_id" = ?  [["student_id", 1]]
---
  def index

    if params[:sort] == "my_services"
      @services = @self_user.services
    elsif params[:sort] == "services_for_me"
      @services = @self_user.student_services
    else
      @services = Service.all

INSERT INTO "services" ("name", "price", "description", "teacher_id", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "IKNOWYOUKNOW"], ["price", 0], ["description", "MYAPP"], ["teacher_id", 1], ["subject_id", 1], ["created_at", "2019-02-05 11:05:00.942851"], ["updated_at", "2019-02-05 11:05:00.942851"]]
---
  def create

    @service = Service.create(
        name: params[:service][:name],
        price: params[:service][:price],
        description: params[:service][:description],
        subject_id: params[:service][:subject_id],
        teacher_id: current_user,
    )

SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @service = Service.find(params[:id])

UPDATE "services" SET "description" = ?, "subject_id" = ?, "updated_at" = ? WHERE "services"."id" = ?  [["description", ""], ["subject_id", 1], ["updated_at", "2019-02-05 10:22:03.573410"], ["id", 2]]
---
  def update
    @service =Service.update(params[:id],
                        name: params[:service][:name],
                        price: params[:service][:price],
                        description: params[:service][:description],
                        subject_id: params[:service][:subject_id]
    )

SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def destroy
    Service.find(params[:id]).delete