app/controllers/subjects_controller.rb

  def index
    if params[:sort] == "my"
      @subjects = @self_user.teacher_subjects
    elsif params[:sort] == "i_use"
      @subjects = @self_user.student_subjects
    else
      @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def create
    @subject = Subject.create(
        name: params[:subject][:name],
        description: params[:subject][:description],
        category_id: params[:subject][:category_id]
    )
---
INSERT INTO "subjects" ("name", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "TEST"], ["description", "TTTTTEST"], ["category_id", 2], ["created_at", "2019-02-08 07:14:08.880668"], ["updated_at", "2019-02-08 07:14:08.880668"]]

  def destroy
    Subject.find(params[:id]).delete
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 4]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]