app/controllers/users_controller.rb

  def index

    if params[:sort] == "my_students"
      @users = @self_user.students.uniq
    elsif params[:sort] == "my_teachers"
      @users = @self_user.teachers.uniq
    else
      @users = User.all.where("id != #{@self_user.id}")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def admin_or_self
    if User.find(current_user).user_role.status != "admin" && current_user != params[:id].to_i || check_login
---
SELECT  "user_roles".* FROM "user_roles" WHERE "user_roles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]