app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (id != 4)

  def create

    @user = User.create(
        name: params[:user][:name],
        lastname: params[:user][:lastname],
        age: params[:user][:age],

        email: params[:user][:email],
        phone: params[:user][:phone],
        login: params[:user][:login],
        password: params[:user][:password],

        description: params[:user][:description]
    )
---
INSERT INTO "users" ("name", "lastname", "age", "login", "password", "email", "phone", "description", "created_at", "updated_at", "user_role_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.update(params[:id],
                        name: params[:user][:name],
                        lastname: params[:user][:lastname],
                        age: params[:user][:age],
                        email: params[:user][:email],
                        phone: params[:user][:phone],
                        login: params[:user][:login],
                        password: params[:user][:password],
                        description: params[:user][:description]
    )
---
UPDATE "users" SET "email" = ?, "phone" = ?, "description" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "dorozhkin.vitaly@gmail.com"], ["phone", ""], ["description", "ADMIN IS ME!!!"], ["updated_at", "2019-02-02 23:57:01.976401"], ["id", 1]]

  def destroy
    User.find(params[:id]).delete
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def check
    user = User.find_by_login(params[:user][:login])
---
SELECT  "users".* FROM "users" WHERE "users"."login" = ? LIMIT ?  [["login", "Petr1"], ["LIMIT", 1]]

  def admin?
    check_login
    if User.find(current_user).user_role.status != "admin"
---
SELECT  "user_roles".* FROM "user_roles" WHERE "user_roles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def check_user
    if !User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def admin_or_self
    if User.find(current_user).user_role.status != "admin" && current_user != params[:id].to_i || check_user
---
SELECT  "user_roles".* FROM "user_roles" WHERE "user_roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def init_user
    if current_user
      @self_user = User.find(current_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]