app/models/user.rb

  def set_user_role
    self.user_role||= UserRole.find_by_status('user')
---
SELECT  "user_roles".* FROM "user_roles" WHERE "user_roles"."status" = ? LIMIT ?  [["status", "user"], ["LIMIT", 1]]