app/views/categories/index.html.erb

  <div class="hover-content">
    <%category.subjects.each do |subject|%>
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."category_id" = ?  [["category_id", 1]]